<details ><summary>apply for portal 2025-03-05 22:40:41 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.portal[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal" {
        id    = "564862953"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.portal_wildcard[0] will be updated in-place
  ~ resource "cloudns_dns_record" "portal_wildcard" {
        id    = "564836688"
        name  = "*"
      ~ value = "104.243.35.45" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # cloudns_dns_record.renterd_bus will be updated in-place
  ~ resource "cloudns_dns_record" "renterd_bus" {
        id    = "564836590"
        name  = "bus.pinner-portal-renterd-cluster.node"
      ~ value = "5j5mvu3unlf1pdq4pe5rm24aq8.ingress.ny-01.node.infra.lumeweb.com" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.portal[0].module.portal_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.redis.module.valkey_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 4 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ mysql_endpoint       = "provider.ny-01.node.infra.lumeweb.com:31058" -> (known after apply)
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.redis.module.valkey_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 30s [id=20511674:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creating...
module.redis.module.valkey_deployment.akash_deployment.service: Creation complete after 36s [id=20511676:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service: Creation complete after 29s [id=20511679:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.portal[0].module.portal_deployment.akash_deployment.service: Creating...
cloudns_dns_record.renterd_bus: Modifying... [id=564836590]
cloudns_dns_record.renterd_bus: Modifications complete after 1s [id=564836590]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.portal[0].module.portal_deployment.akash_deployment.service: Creation complete after 31s [id=20511684:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]

Apply complete! Resources: 4 added, 1 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:31080"
renterd_bus_endpoint = "bus.pinner-portal-renterd-cluster.node.pinner.xyz"

```
</details>
</details>